Catalogs/ШаблоныКонтрольныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныКонтрольныхТочек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаКТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГруппКонтрольныхТочек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыШаблоновКТ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньКТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УровниКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧисловойКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЧислоКТВКонтейнерах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЧислоКТВКонтейнерах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧислоКТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтейнерКТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерыКТ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ШаблоныГруппКонтрольныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныГруппКонтрольныхТочек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектКТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыШаблоновКТ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВДокументах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенныеВебСерверы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПереписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПерепискеСРангом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЯзыка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ra_UserAD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_КонтролерКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_РуководительКонтролераКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_ОтветственныйЗаКачествоВыявивший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_ОтветственныйЗаКачествоДопустивший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_ОтветственныйЗаКачествоВнутренний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_АдминистраторBitrix</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_ПрошелОбучение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ra_UserInter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ra_UserGK</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_ПодписаниеSigФайлом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ra_Status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ра_Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныКонтрольныхТочек/Forms/ШаблонКТОбъекта/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектКТ = Параметры.ОбъектКТ;
	
	Заголовок = НСтр("ru = 'Шаблон контрольных точек (" + ОбъектКТ + ")'; en = 'Milestone template (" + ОбъектКТ + ")'");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
		"ОбъектКТ",
		ОбъектКТ,
		ВидСравненияКомпоновкиДанных.Равно);
		
	Элементы.ПоказыватьУдаленные.Пометка = ПоказыватьУдаленные;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь,
		ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	ЗаполнитьТаблицуГрупп();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ШаблонКонтрольнойТочки" И Параметр = ОбъектКТ Тогда
		ПеречитатьТаблицуГрупп();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппыКТВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элементы.ГруппыКТ.ТекущиеДанные.Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыКТПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыКТПриАктивизацииСтроки(Элемент)
	
	Если ТекущаяГруппаКТ <> Элементы.ГруппыКТ.ТекущиеДанные.Группа Тогда 
		
		ТекущаяГруппаКТ = Элементы.ГруппыКТ.ТекущиеДанные.Группа;
		
		ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыКТПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ДобавитьГруппуКлиент();
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыКТПередУдалением(Элемент, Отказ)
	
	УдалитьГруппу();
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СоздатьКТ();
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьГруппы(Команда)
	
	ПеречитатьТаблицуГрупп();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ДобавитьГруппуКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	СоздатьКТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленные(Команда)
	
	ПоказыватьУдаленные = Не ПоказыватьУдаленные;
	Элементы.ПоказыватьУдаленные.Пометка = ПоказыватьУдаленные;
	
	Если Не ПоказыватьУдаленные Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ПометкаУдаления", Ложь,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПометкаУдаления");
	КонецЕсли;
	
	ПеречитатьТаблицуГрупп();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.Фильтр = "XML (*.xml)|*.xml"; 

	Если Диалог.Выбрать() Тогда
		ЧтениеТекста = Новый ЧтениеТекста(Диалог.ПолноеИмяФайла);
		СтрокаXML = ЧтениеТекста.Прочитать();
		ЗагрузитьНаСервере(СтрокаXML, ОбъектКТ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьГруппуКлиент()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектКТ", ОбъектКТ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавитьГруппуПродолжение",
		ЭтотОбъект);
	
	ОткрытьФорму(
		"Справочник.ШаблоныГруппКонтрольныхТочек.Форма.ФормаЭлемента", 
		ПараметрыФормы, ЭтаФорма, , , , 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьГруппуПродолжение(Результат, Параметры) Экспорт	
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПеречитатьТаблицуГрупп();
		
		НайденныеСтроки = ГруппыКТ.НайтиСтроки(Новый Структура("Группа", Результат));
		Элементы.ГруппыКТ.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуГрупп()
	
	ГруппыКТ.Очистить();
	
	Строка = ГруппыКТ.Добавить();
	Строка.Группа = Справочники.ШаблоныГруппКонтрольныхТочек.Все;
	ЧислоКТ = РегистрыСведений.ЧислоКТВКонтейнерах.ПолучитьЧислоКТПоКонтейнеру(ОбъектКТ);;
	Строка.НаименованиеГруппы = Строка(Строка.Группа) + " (" + Строка(ЧислоКТ) + ")";
	Строка.ОтображатьЖирным = Истина;
	Строка.ПометкаУдаления = Ложь;
	
	Строка = ГруппыКТ.Добавить();
	Строка.Группа = Справочники.ШаблоныГруппКонтрольныхТочек.НеВГруппе;
	ЧислоКТ = КонтрольныеТочки.ПолучитьЧислоКТБезГруппы(ОбъектКТ);
	Строка.НаименованиеГруппы = Строка(Строка.Группа) + " (" + Строка(ЧислоКТ) + ")";
	Строка.ОтображатьКрасным = Истина;
	Строка.ПометкаУдаления = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныГруппКонтрольныхТочек.Ссылка,
		|	ВЫБОР 
		|		КОГДА ЧислоКТВКонтейнерах.ЧислоКТ ЕСТЬ NULL ТОГДА 0
		|		ИНАЧЕ ЧислоКТВКонтейнерах.ЧислоКТ
		|	КОНЕЦ КАК ЧислоКТ,
		|	ШаблоныГруппКонтрольныхТочек.ПометкаУдаления
		|
		|ИЗ
		|	Справочник.ШаблоныГруппКонтрольныхТочек КАК ШаблоныГруппКонтрольныхТочек
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧислоКТВКонтейнерах КАК ЧислоКТВКонтейнерах
		|		ПО ЧислоКТВКонтейнерах.КонтейнерКТ = ШаблоныГруппКонтрольныхТочек.Ссылка";
		
	Если Не ПоказыватьУдаленные Тогда
		Запрос.Текст = Запрос.Текст +	
			"
			|ГДЕ
			|	ШаблоныГруппКонтрольныхТочек.ПометкаУдаления = &ПометкаУдаления
			|	И ШаблоныГруппКонтрольныхТочек.ОбъектКТ = &ОбъектКТ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШаблоныГруппКонтрольныхТочек.Наименование";
			
		Запрос.УстановитьПараметр("ПометкаУдаления", ПоказыватьУдаленные);
	Иначе		
		Запрос.Текст = Запрос.Текст +	
			"
			|ГДЕ
			|	ШаблоныГруппКонтрольныхТочек.ОбъектКТ = &ОбъектКТ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШаблоныГруппКонтрольныхТочек.Наименование";
	КонецЕсли;	

	Запрос.УстановитьПараметр("ОбъектКТ", ОбъектКТ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		                                                                   
		Строка = ГруппыКТ.Добавить();
		Строка.Группа = Выборка.Ссылка;
		Строка.НаименованиеГруппы = Строка(Выборка.Ссылка) + " (" + Строка(Выборка.ЧислоКТ) + ")";
		Строка.ПометкаУдаления = Выборка.ПометкаУдаления;
		
	КонецЦикла;
	
КонецПроцедуры		
	
&НаКлиенте
Процедура СоздатьКТ()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектКТ", ОбъектКТ);
	Если ТекущаяГруппаКТ <> ПредопределенноеЗначение("Справочник.ШаблоныГруппКонтрольныхТочек.Все") 
		И ТекущаяГруппаКТ <> ПредопределенноеЗначение("Справочник.ШаблоныГруппКонтрольныхТочек.НеВГруппе") Тогда
		ПараметрыФормы.Вставить("ГруппаКТ", ТекущаяГруппаКТ);
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.ШаблоныКонтрольныхТочек.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если ЗначениеЗаполнено(ТекущаяГруппаКТ) Тогда 
		
		Если ТекущаяГруппаКТ = ПредопределенноеЗначение("Справочник.ШаблоныГруппКонтрольныхТочек.НеВГруппе") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ГруппаКТ", 
				ПредопределенноеЗначение("Справочник.ШаблоныГруппКонтрольныхТочек.ПустаяСсылка"));
		ИначеЕсли ТекущаяГруппаКТ = ПредопределенноеЗначение("Справочник.ШаблоныГруппКонтрольныхТочек.Все") Тогда		
			ОтключитьПараметрОтбора("ГруппаКТ")
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("ГруппаКТ", 
				ТекущаяГруппаКТ);
		КонецЕсли;			
			
	Иначе
		
		ОтключитьПараметрОтбора("ГруппаКТ")
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПараметрОтбора(ПараметрОтбора)
	
	Параметр = Список.Параметры.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных(ПараметрОтбора));
	Если Параметр <> Неопределено И Параметр.Использование Тогда 
		Параметр.Использование = Ложь;
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьГруппу()
	
	Если Элементы.ГруппыКТ.ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстВопроса = НСтр("ru = 'Пометить на удаление выбранные группы ("
			+ Элементы.ГруппыКТ.ВыделенныеСтроки.Количество() + ") и входящие в них контрольные точки?';
			|en = 'Mark for deletion the selected groups ("
			+ Элементы.ГруппыКТ.ВыделенныеСтроки.Количество() + ") and all their milestones?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Пометить на удаление выбранную группу и входящие в нее контрольные точки?'; en = 'Mark for deletion the selected group and all its milestones?'");
	КонецЕсли;	
	
	Режим = Новый СписокЗначений;
	Режим.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'ОК'; en = 'ОК'"));
	Режим.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отмена'; en = 'Cancel'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УдалениеГруппПродолжение",
		ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Режим, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеГруппПродолжение(Ответ, Параметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
	    Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Идет удаление групп и контрольных точек. Пожалуйста подождите...'; en = 'Deleting groups and milestones. Please wait ...'"));
	
	УдалениеГруппПродолжениеСервер();
	
	Состояние(НСтр("ru = 'Группы и контрольные точки удалены.'; en = 'Groups and milestones deleted.'"));
	
КонецПроцедуры

&НаСервере
Процедура УдалениеГруппПродолжениеСервер()
	
	НачатьТранзакцию();
	
	Попытка
		
		ВыделенныеСтроки = Элементы.ГруппыКТ.ВыделенныеСтроки;
		Для Каждого Эл Из ВыделенныеСтроки Цикл
			
			Группа = ГруппыКТ.НайтиПоИдентификатору(Эл).Группа.ПолучитьОбъект();
			Если Не Группа.Предопределенный Тогда
				Группа.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ШаблоныКонтрольныхТочек.Ссылка
				|ИЗ
				|	Справочник.ШаблоныКонтрольныхТочек КАК ШаблоныКонтрольныхТочек
				|ГДЕ
				|	ШаблоныКонтрольныхТочек.ПометкаУдаления = Ложь
				|	И ШаблоныКонтрольныхТочек.ГруппаКТ = &ГруппаКТ";
			
			Запрос.УстановитьПараметр("ГруппаКТ", Группа.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				КТ = Выборка.Ссылка.ПолучитьОбъект();
				КТ.УстановитьПометкуУдаления(Истина);
			КонецЦикла;
	
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;	
	
	ЗаполнитьТаблицуГрупп();
		
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьТаблицуГрупп()

	ЗаполнитьТаблицуГрупп();
	
	НайденныеСтроки = ГруппыКТ.НайтиСтроки(Новый Структура("Группа", ТекущаяГруппаКТ));
	Элементы.ГруппыКТ.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		
КонецПроцедуры		

&НаСервере
Процедура ЗагрузитьНаСервере(СтрокаXML, ОбъектКТ)
	
	// Удаление существующих групп и контрольных точек
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныКонтрольныхТочек.Ссылка
		|ИЗ
		|	Справочник.ШаблоныКонтрольныхТочек КАК ШаблоныКонтрольныхТочек
		|ГДЕ
		|	ШаблоныКонтрольныхТочек.ОбъектКТ = &ОбъектКТ
		|	И ШаблоныКонтрольныхТочек.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("ОбъектКТ", ОбъектКТ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КТ = Выборка.Ссылка.ПолучитьОбъект();
		КТ.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныГруппКонтрольныхТочек.Ссылка
		|ИЗ
		|	Справочник.ШаблоныГруппКонтрольныхТочек КАК ШаблоныГруппКонтрольныхТочек
		|ГДЕ
		|	ШаблоныГруппКонтрольныхТочек.ОбъектКТ = &ОбъектКТ
		|	И ШаблоныГруппКонтрольныхТочек.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("ОбъектКТ", ОбъектКТ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ГруппаКТ = Выборка.Ссылка.ПолучитьОбъект();
		ГруппаКТ.УстановитьПометкуУдаления(Истина);
	КонецЦикла;

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ТекущаяГруппа = Неопределено;
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.ЛокальноеИмя = "ГруппаКТ" Тогда
			
			НоваяГруппа = Справочники.ШаблоныГруппКонтрольныхТочек.СоздатьЭлемент();
			
			НоваяГруппа.Наименование = ЧтениеXML.ЗначениеАтрибута("Наименование");
			НоваяГруппа.Комментарий = ЧтениеXML.ЗначениеАтрибута("Комментарий");
			ИД = Новый УникальныйИдентификатор(ЧтениеXML.ЗначениеАтрибута("Ответственный"));
			НоваяГруппа.Ответственный = Справочники.Пользователи.ПолучитьСсылку(ИД);
			НоваяГруппа.ОбъектКТ = ОбъектКТ;
			
			НоваяГруппа.Записать();
			
			ТекущаяГруппа = НоваяГруппа.Ссылка;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.ЛокальноеИмя = "КТ" Тогда
			
			НоваяКТ = Справочники.ШаблоныКонтрольныхТочек.СоздатьЭлемент();
			НоваяКТ.ОбъектКТ = ОбъектКТ;
			НоваяКТ.ГруппаКТ = ТекущаяГруппа;
			
			НоваяКТ.Наименование = ЧтениеXML.ЗначениеАтрибута("Наименование");
			НоваяКТ.КодКТ = ЧтениеXML.ЗначениеАтрибута("КодКТ");
			НоваяКТ.Комментарий = ЧтениеXML.ЗначениеАтрибута("Комментарий");
			НоваяКТ.Описание = ЧтениеXML.ЗначениеАтрибута("Описание");
			
			ИД = Новый УникальныйИдентификатор(ЧтениеXML.ЗначениеАтрибута("Ответственный"));
			НоваяКТ.Ответственный = Справочники.Пользователи.ПолучитьСсылку(ИД);
			
			НоваяКТ.ДлительностьДней = ЧтениеXML.ЗначениеАтрибута("ДлительностьДней");
			НоваяКТ.ДлительностьЧасов = ЧтениеXML.ЗначениеАтрибута("ДлительностьЧасов");
			НоваяКТ.ДлительностьМинут = ЧтениеXML.ЗначениеАтрибута("ДлительностьМинут");
			Если НоваяКТ.ДлительностьДней >= 3 Тогда
				НоваяКТ.ДлительностьЧасов = 0;
				НоваяКТ.ДлительностьМинут = 0;
			КонецЕсли;
			
			ИД = Новый УникальныйИдентификатор(ЧтениеXML.ЗначениеАтрибута("Проверяющий"));
			НоваяКТ.Проверяющий = Справочники.Пользователи.ПолучитьСсылку(ИД);
			
			НоваяКТ.Результат = ЧтениеXML.ЗначениеАтрибута("Результат");
			
			ИД = Новый УникальныйИдентификатор(ЧтениеXML.ЗначениеАтрибута("УровеньКТ"));
			НоваяКТ.УровеньКТ = Справочники.УровниКонтроля.ПолучитьСсылку(ИД);
			
			НоваяКТ.Записать();
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ЗаполнитьТаблицуГрупп();
	
КонецПроцедуры

#КонецОбласти
